Revit 2026 API

# KeyBasedTreeFileFailures Properties

---

The BuiltInFailuresKeyBasedTreeFileFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CannotOpenFileForRead | Cannot open file [FileName]. |
|  | CannotUnderstandAtLine | Cannot understand [EntryType] line '[Number]' |

#### Reference

BuiltInFailuresKeyBasedTreeFileFailures Class

Autodesk.Revit.DB Namespace